espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_core.h
/***************************************************************************//**
 * @file
 * @brief USB Device Core Operations
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/****************************************************************************************************//**
 * @defgroup USBD USB Device API
 * @brief   USB Device API
 *
 * @defgroup USBD_CORE USB Device Core API
 * @ingroup USBD
 * @brief   USB Device Core API
 *
 * @addtogroup USBD_CORE
 * @{
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               MODULE
 ********************************************************************************************************
 *******************************************************************************************************/

#ifndef  SL_USBD_CORE_H
#define  SL_USBD_CORE_H

/********************************************************************************************************
 ********************************************************************************************************
 *                                               INCLUDE FILES
 ********************************************************************************************************
 *******************************************************************************************************/

#include <stddef.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "em_device.h"

#include "sl_enum.h"
#include "sl_status.h"

#include "sl_usbd_core_config.h"

/********************************************************************************************************
 ********************************************************************************************************
 *                                               MACROS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                                   FRAME
 *
 * Note(s) : (1) Section 8.3.3 of USB spec 2.0 describes the frame number as:
 *               "The frame number field is an 11-bit field that is incremented by the host on a per-frame
 *                   basis. The frame number field rolls over upon reaching its maximum value of 7FFH and
 *                   is sent only in SOF tokens at the start of each (micro)frame."
 *******************************************************************************************************/

#define  SL_USBD_FRAME_NBR_MAX                     2047u              // See Note #1.
#define  SL_USBD_FRAME_NBR_MASK                    0b0000011111111111 // 0x07FF // DEF_BIT_FIELD_16(11u, 0u)
#define  SL_USBD_MICROFRAME_NBR_MASK               0b0011100000000000 // 0x3800 //DEF_BIT_FIELD_16(3u, 11u)

/********************************************************************************************************
 *                                       CONFIGURATION ATTRIBUTES
 *******************************************************************************************************/

#define  SL_USBD_DEV_ATTRIB_SELF_POWERED           0x01u  // BIT_00
#define  SL_USBD_DEV_ATTRIB_REMOTE_WAKEUP          0x02u  // BIT_01

/********************************************************************************************************
 *                                       DEVICE DESCRIPTOR LENGTH
 *******************************************************************************************************/

#define  SL_USBD_DESC_LEN_DEV                                18u   // Device                    descriptor length.
#define  SL_USBD_DESC_LEN_DEV_QUAL                           10u   // Device qualifier          descriptor length.
#define  SL_USBD_DESC_LEN_HDR                                 2u   // Descriptor header                    length.
#define  SL_USBD_DESC_LEN_CFG                                 9u   // Configuration             descriptor length.
#define  SL_USBD_DESC_LEN_OTHER_SPD_CFG                       9u   // Configuration other speed descriptor length.
#define  SL_USBD_DESC_LEN_IF                                  9u   // Interface                 descriptor length.
#define  SL_USBD_DESC_LEN_IF_ASSOCIATION                      8u   // Interface association     descriptor length.
#define  SL_USBD_DESC_LEN_EP                                  7u   // Endpoint                  descriptor length.
#define  SL_USBD_DESC_LEN_OTG                                 3u   // On-The-Go                 descriptor length

/****************************************************************************************************//**
 *                                       REQUEST CHARACTERISTICS
 *
 * Note(s) : (1) Request types are defined in USB spec 2.0, section 9.3, Table 9-2, 'RequestType' field.
 *******************************************************************************************************/

#define  SL_USBD_REQ_DIR_MASK                              0x80u  // BIT_07
#define  SL_USBD_REQ_DIR_HOST_TO_DEVICE                    0x00u  // NONE
#define  SL_USBD_REQ_DIR_DEVICE_TO_HOST                    0x80u  // BIT_07
#define  SL_USBD_REQ_DIR_BIT                               0x80u  // BIT_07

#define  SL_USBD_REQ_TYPE_MASK                             0x60u
#define  SL_USBD_REQ_TYPE_STANDARD                         0x00u
#define  SL_USBD_REQ_TYPE_CLASS                            0x20u
#define  SL_USBD_REQ_TYPE_VENDOR                           0x40u
#define  SL_USBD_REQ_TYPE_RESERVED                         0x60u

#define  SL_USBD_REQ_RECIPIENT_MASK                        0x1Fu
#define  SL_USBD_REQ_RECIPIENT_DEVICE                      0x00u
#define  SL_USBD_REQ_RECIPIENT_INTERFACE                   0x01u
#define  SL_USBD_REQ_RECIPIENT_ENDPOINT                    0x02u
#define  SL_USBD_REQ_RECIPIENT_OTHER                       0x03u

/****************************************************************************************************//**
 *                                           STANDARD REQUESTS
 *
 * Note(s) : (1) Request types are defined in USB spec 2.0, section 9.4, Table 9-4, 'RequestType' field.
 *******************************************************************************************************/

#define  SL_USBD_REQ_GET_STATUS                               0u
#define  SL_USBD_REQ_CLEAR_FEATURE                            1u
#define  SL_USBD_REQ_SET_FEATURE                              3u
#define  SL_USBD_REQ_SET_ADDRESS                              5u
#define  SL_USBD_REQ_GET_DESCRIPTOR                           6u
#define  SL_USBD_REQ_SET_DESCRIPTOR                           7u
#define  SL_USBD_REQ_GET_CONFIGURATION                        8u
#define  SL_USBD_REQ_SET_CONFIGURATION                        9u
#define  SL_USBD_REQ_GET_INTERFACE                           10u
#define  SL_USBD_REQ_SET_INTERFACE                           11u
#define  SL_USBD_REQ_SYNCH_FRAME                             12u

/****************************************************************************************************//**
 *                                           DESCRIPTOR TYPES
 *
 * Note(s) : (1) Descriptors types are defined in the USB spec 2.0 section 9.2.6, Table 9-5.
 *******************************************************************************************************/

#define  SL_USBD_DESC_TYPE_DEVICE                             1u
#define  SL_USBD_DESC_TYPE_CONFIGURATION                      2u
#define  SL_USBD_DESC_TYPE_STRING                             3u
#define  SL_USBD_DESC_TYPE_INTERFACE                          4u
#define  SL_USBD_DESC_TYPE_ENDPOINT                           5u
#define  SL_USBD_DESC_TYPE_DEVICE_QUALIFIER                   6u
#define  SL_USBD_DESC_TYPE_OTHER_SPEED_CONFIGURATION          7u
#define  SL_USBD_DESC_TYPE_INTERFACE_POWER                    8u
#define  SL_USBD_DESC_TYPE_OTG                                9u
#define  SL_USBD_DESC_TYPE_IAD                               11u

/****************************************************************************************************//**
 *                                           LANGUAGE IDENTIFIERS
 *
 * Note(s) : (1) Languages identifier are defined in "http://www.usb.org/developers/docs/USB_LANGIDs.pdf".
 *******************************************************************************************************/

#define  SL_USBD_LANG_ID_ARABIC_SAUDI_ARABIA             0x0401u
#define  SL_USBD_LANG_ID_CHINESE_TAIWAN                  0x0404u
#define  SL_USBD_LANG_ID_ENGLISH_US                      0x0409u
#define  SL_USBD_LANG_ID_ENGLISH_UK                      0x0809u
#define  SL_USBD_LANG_ID_FRENCH                          0x040Cu
#define  SL_USBD_LANG_ID_GERMAN                          0x0407u
#define  SL_USBD_LANG_ID_GREEK                           0x0408u
#define  SL_USBD_LANG_ID_ITALIAN                         0x0410u
#define  SL_USBD_LANG_ID_PORTUGUESE                      0x0816u
#define  SL_USBD_LANG_ID_SANSKRIT                        0x044Fu

/****************************************************************************************************//**
 *                                               CLASS CODES
 *
 * Note(s) : (1) Class codes are defined in "http://www.usb.org/developers/defined_class".
 *
 *           (2) Class code information can be placed in the Device descriptor or in the Interface
 *               descriptor. Some defined class code are allowed to be used only in the Device
 *               descriptor, others can used in both Device and Interface descriptors and come can
 *               only be used in Interface Descriptors.
 *
 *           (3) Subclass & protocol codes are defined in the relevant class drivers.
 *******************************************************************************************************/

#define  SL_USBD_CLASS_CODE_USE_IF_DESC                    0x00u
#define  SL_USBD_CLASS_CODE_AUDIO                          0x01u
#define  SL_USBD_CLASS_CODE_CDC_CONTROL                    0x02u
#define  SL_USBD_CLASS_CODE_HID                            0x03u
#define  SL_USBD_CLASS_CODE_PHYSICAL                       0x05u
#define  SL_USBD_CLASS_CODE_IMAGE                          0x06u
#define  SL_USBD_CLASS_CODE_PRINTER                        0x07u
#define  SL_USBD_CLASS_CODE_MASS_STORAGE                   0x08u
#define  SL_USBD_CLASS_CODE_HUB                            0x09u
#define  SL_USBD_CLASS_CODE_CDC_DATA                       0x0Au
#define  SL_USBD_CLASS_CODE_SMART_CARD                     0x0Bu
#define  SL_USBD_CLASS_CODE_CONTENT_SECURITY               0x0Du
#define  SL_USBD_CLASS_CODE_VIDEO                          0x0Eu
#define  SL_USBD_CLASS_CODE_PERSONAL_HEALTHCARE            0x0Fu
#define  SL_USBD_CLASS_CODE_DIAGNOSTIC_DEVICE              0xDCu
#define  SL_USBD_CLASS_CODE_WIRELESS_CONTROLLER            0xE0u
#define  SL_USBD_CLASS_CODE_MISCELLANEOUS                  0xEFu
#define  SL_USBD_CLASS_CODE_APPLICATION_SPECIFIC           0xFEu
#define  SL_USBD_CLASS_CODE_VENDOR_SPECIFIC                0xFFu

/********************************************************************************************************
 *                                           SUB-CLASS CODES
 *******************************************************************************************************/

#define  SL_USBD_SUBCLASS_CODE_USE_IF_DESC                 0x00u
#define  SL_USBD_SUBCLASS_CODE_USE_COMMON_CLASS            0x02u
#define  SL_USBD_SUBCLASS_CODE_VENDOR_SPECIFIC             0xFFu

/********************************************************************************************************
 *                                           PROTOCOL CODES
 *******************************************************************************************************/

#define  SL_USBD_PROTOCOL_CODE_USE_IF_DESC                 0x00u
#define  SL_USBD_PROTOCOL_CODE_USE_IAD                     0x01u
#define  SL_USBD_PROTOCOL_CODE_VENDOR_SPECIFIC             0xFFu

/********************************************************************************************************
 *                                           FEATURE SELECTORS
 *******************************************************************************************************/

#define  SL_USBD_FEATURE_SEL_ENDPOINT_HALT                    0u
#define  SL_USBD_FEATURE_SEL_DEVICE_REMOTE_WAKEUP             1u
#define  SL_USBD_FEATURE_SEL_TEST_MODE                        2u

/********************************************************************************************************
 *                                       DEVICE POWER CONSTRAINS
 *******************************************************************************************************/

#define  SL_USBD_MAX_BUS_PWR_LIMIT_mA                       500u

/********************************************************************************************************
 *                                               ENDPOINT TYPE
 *
 * Note(s) : (1) Endpoint types are defined in the USB spec 2.0 section 9.6.6, Table 9-13, 'bmAttributes'
 *               field.
 *******************************************************************************************************/

#define  SL_USBD_ENDPOINT_TYPE_MASK                              0x03u
#define  SL_USBD_ENDPOINT_TYPE_CTRL                              0x00u
#define  SL_USBD_ENDPOINT_TYPE_ISOC                              0x01u
#define  SL_USBD_ENDPOINT_TYPE_BULK                              0x02u
#define  SL_USBD_ENDPOINT_TYPE_INTR                              0x03u

#define  SL_USBD_ENDPOINT_TYPE_SYNC_MASK                         0x0Cu
#define  SL_USBD_ENDPOINT_TYPE_SYNC_NONE                         0x00u
#define  SL_USBD_ENDPOINT_TYPE_SYNC_ASYNC                        0x04u
#define  SL_USBD_ENDPOINT_TYPE_SYNC_ADAPTIVE                     0x08u
#define  SL_USBD_ENDPOINT_TYPE_SYNC_SYNC                         0x0Cu

#define  SL_USBD_ENDPOINT_TYPE_USAGE_MASK                        0x30u
#define  SL_USBD_ENDPOINT_TYPE_USAGE_DATA                        0x00u
#define  SL_USBD_ENDPOINT_TYPE_USAGE_FEEDBACK                    0x10u
#define  SL_USBD_ENDPOINT_TYPE_USAGE_IMPLICIT_FEEDBACK           0x20u

/********************************************************************************************************
 *                                           ENDPOINT ADDRESS
 *
 * Note(s) : (1) Endpoint address is defined in the USB spec 2.0, section 9.6.6, Table 9-13,
 *               'bEndpointAddress' field.
 *******************************************************************************************************/

#define  SL_USBD_ENDPOINT_NBR_MASK                               0x0Fu
#define  SL_USBD_ENDPOINT_MAX_NBR                                  32u

