espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_core.h
#define  SL_USBD_ENDPOINT_DIR_MASK                               0x80u
#define  SL_USBD_ENDPOINT_DIR_BIT                                0x80u // BIT_07
#define  SL_USBD_ENDPOINT_DIR_OUT                                0x00u // NONE
#define  SL_USBD_ENDPOINT_DIR_IN                                 0x80u // BIT_07

#define  SL_USBD_ENDPOINT_TRANSACTION_PER_UFRAME_1                  1u
#define  SL_USBD_ENDPOINT_TRANSACTION_PER_UFRAME_2                  2u
#define  SL_USBD_ENDPOINT_TRANSACTION_PER_UFRAME_3                  3u

#define  SL_USBD_ENDPOINT_MAX_INTERVAL_VAL                      32768u   // Max val is 2^(16 - 1).

/********************************************************************************************************
 *                                       MICROSOFT OS DESCRIPTOR DEFINES
 *
 * Note(s)     : (1) For more information on Microsoft OS descriptors, see
 *                   'http://msdn.microsoft.com/en-us/library/windows/hardware/gg463179.aspx'.
 *******************************************************************************************************/

//                                                                 Microsoft OS compatible IDs index.
#define  SL_USBD_MICROSOFT_COMPAT_ID_NULL                         0u
#define  SL_USBD_MICROSOFT_COMPAT_ID_RNDIS                        1u
#define  SL_USBD_MICROSOFT_COMPAT_ID_PTP                          2u
#define  SL_USBD_MICROSOFT_COMPAT_ID_MTP                          3u
#define  SL_USBD_MICROSOFT_COMPAT_ID_XUSB20                       4u
#define  SL_USBD_MICROSOFT_COMPAT_ID_BLUETOOTH                    5u
#define  SL_USBD_MICROSOFT_COMPAT_ID_WINUSB                       6u
#define  SL_USBD_MICROSOFT_COMPAT_ID_NONE                       255u

//                                                                 Microsoft OS subcompatible IDs index.
#define  SL_USBD_MICROSOFT_SUBCOMPAT_ID_NULL                      0u
#define  SL_USBD_MICROSOFT_SUBCOMPAT_ID_BLUETOOTH_1_1             1u
#define  SL_USBD_MICROSOFT_SUBCOMPAT_ID_BLUETOOTH_1_2             2u
#define  SL_USBD_MICROSOFT_SUBCOMPAT_ID_BLUETOOTH_EDR             3u

//                                                                 Microsoft OS extended property types.
#define  SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_SZ                   1u   // NULL-terminated Unicode str.
#define  SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_EXPAND_SZ            2u   // NULL-terminated Unicode str with environment vars.
#define  SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_BINARY               3u   // Free-form binary.
#define  SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_DWORD_LITTLE_ENDIAN  4u   // Little-endian 32-bit integer.
#define  SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_DWORD_BIG_ENDIAN     5u   // Big-endian 32-bit integer.
#define  SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_LINK                 6u   // NULL-terminated Unicode str with a symbolic link.
#define  SL_USBD_MICROSOFT_PROPERTY_TYPE_REG_MULTI_SZ             7u   // Multiple NULL-terminated Unicode strings.

/********************************************************************************************************
 *                                   USB EP INFORMATION TABLE DEFINES
 *******************************************************************************************************/

//                                                                 ------------- ENDPOINT TYPE BIT DEFINES ------------
#define  SL_USBD_ENDPOINT_INFO_TYPE_CTRL                 0x01u // BIT_00
#define  SL_USBD_ENDPOINT_INFO_TYPE_ISOC                 0x02u // BIT_01
#define  SL_USBD_ENDPOINT_INFO_TYPE_BULK                 0x04u // BIT_02
#define  SL_USBD_ENDPOINT_INFO_TYPE_INTR                 0x08u // BIT_03

//                                                                 ---------- ENDPOINT DIRECTION BIT DEFINES ----------
#define  SL_USBD_ENDPOINT_INFO_DIR_OUT                   0x10u // BIT_04
#define  SL_USBD_ENDPOINT_INFO_DIR_IN                    0x20u // BIT_05

/********************************************************************************************************
 *                                           USB OBJECT NUMBER
 *******************************************************************************************************/

#define  SL_USBD_CONFIG_NBR_NONE                          255u
#define  SL_USBD_CONFIG_NBR_SPD_BIT                       0x80u // BIT_07

#define  SL_USBD_INTERFACE_NBR_NONE                       255u

#define  SL_USBD_ALT_INTERFACE_NBR_NONE                   255u

#define  SL_USBD_INTERFACE_GROUP_NBR_NONE                 255u

#define  SL_USBD_ENDPOINT_ADDR_NONE                       255u
#define  SL_USBD_ENDPOINT_PHY_NONE                        255u

#define  SL_USBD_ENDPOINT_NBR_NONE                        255u

#define  SL_USBD_CLASS_NBR_NONE                           255u

/********************************************************************************************************
 *                                           USB DEFAULT CONFIGS
 *******************************************************************************************************/

#ifndef USBD_CFG_STR_EN
#define USBD_CFG_STR_EN            1
#endif

#ifndef USBD_CFG_MS_OS_DESC_EN
#define USBD_CFG_MS_OS_DESC_EN     0
#endif

#ifndef USBD_CFG_URB_EXTRA_EN
#define USBD_CFG_URB_EXTRA_EN      0
#endif

#if (USBD_CFG_URB_EXTRA_EN == 1)
#define SL_USBD_URB_MAX_NBR  (SL_USBD_OPEN_ENDPOINTS_QUANTITY + SL_USBD_EXTRA_URB_QUANTITY)
#else
#define SL_USBD_URB_MAX_NBR  SL_USBD_OPEN_ENDPOINTS_QUANTITY
#endif

/********************************************************************************************************
 *                                               USB CORE EVENTS
 *
 * Note(s) : (1) There are 7 possible USB callback events:
 *
 *                   sli_usbd_core_reset_event(),
 *                   sli_usbd_core_suspend_event(),
 *                   sli_usbd_core_resume_event(),
 *                   sli_usbd_core_connect_event(),
 *                   sli_usbd_core_disconnect_event(),
 *                   sli_usbd_core_high_speed_event().
 *******************************************************************************************************/

#define  SL_USBD_CORE_EVENT_BUS_NBR                          7u    // Number of bus events per controller.

#define SL_USBD_CORE_EVENT_BUS_NBR_TOTAL  (SL_USBD_CORE_EVENT_BUS_NBR * SL_USBD_DEVICE_QUANTITY)
#define SL_USBD_CORE_EVENT_ASYNC_NBR ((SL_USBD_OPEN_ENDPOINTS_QUANTITY * SL_USBD_DEVICE_QUANTITY) + SL_USBD_EXTRA_URB_QUANTITY)
#define SL_USBD_CORE_EVENT_NBR_TOTAL  (SL_USBD_CORE_EVENT_BUS_NBR_TOTAL + SL_USBD_CORE_EVENT_ASYNC_NBR)

/********************************************************************************************************
 ********************************************************************************************************
 *                                               DATA TYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                       USB DEVICE SPEED DATA TYPE
 *
 * @note     (1) 'Universal Serial Bus Specification Rev 2.0', section 4.2.1 defines three data rates:
 *               - (a) The USB  Low-Speed (LS) signaling bit rate is   1.5 Mb/s.
 *               - (b) The USB Full-Speed (FS) signaling bit rate is  12   Mb/s.
 *               - (c) The USB High-Speed (HS) signaling bit rate is 480   Mb/s.
 *******************************************************************************************************/

SL_ENUM(sl_usbd_device_speed_t) {
  SL_USBD_DEVICE_SPEED_INVALID = 0u,
  SL_USBD_DEVICE_SPEED_LOW,                                             ///<  Low-Speed (see Note #1a).
  SL_USBD_DEVICE_SPEED_FULL,                                            ///< Full-Speed (see Note #1b).
  SL_USBD_DEVICE_SPEED_HIGH                                             ///< High-Speed (see Note #1c).
};

/****************************************************************************************************//**
 *                                       USB DEVICE STATES DATA TYPE
 *
 * @note     (1) 'Universal Serial Bus Specification Rev 2.0', section 9.1.1 defines seven visible device
 *                   states:
 *               - (a) SL_USBD_DEVICE_STATE_INIT       : Device is not attached to the USB.
 *               - (b) SL_USBD_DEVICE_STATE_ATTACHED   : Device is attached to the USB, but not powered.
 *               - (c) USBD_DEV_STATE_POWERED    : Device is attached to the USB and powered, but has not
 *                                               been reset.
 *               - (d) SL_USBD_DEVICE_STATE_DEFAULT    : Device is attached to the USB and powered and has been
 *                                               reset, but has not been assigned a unique address.
 *                                               Device responds at the default address.
 *               - (e) SL_USBD_DEVICE_STATE_ADDRESSED  : Device is attached to the USB, powered, has been reset,
 *                                               and a unique device address has been assigned. Device
 *                                               is not configured.
 *               - (f) SL_USBD_DEVICE_STATE_CONFIGURED : Device is attached to the USB, powered, has been reset,
 *                                               has a unique  address, is configured, and is not suspended.
 *                                               The host may now use the function provided by the device.
 *               - (g) SL_USBD_DEVICE_STATE_SUSPENDED  : Device is, at minimum, attached to the USB and is powered
 *                                               and has not  seen bus activity for 3 ms. It may also have
 *                                               a unique address and be  configured for use. However,
 *                                               because the device is suspended, the host may not use the
 *                                               device's function.
 * @note     (2) An additional state is added (USBD_DEV_STATE_START) to determine if the device controller
 *               has been initialized.
 *******************************************************************************************************/

