espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_core.h
SL_ENUM(sl_usbd_device_state_t) {
  SL_USBD_DEVICE_STATE_NONE = 0,
  SL_USBD_DEVICE_STATE_INIT,
  SL_USBD_DEVICE_STATE_ATTACHED,
  SL_USBD_DEVICE_STATE_DEFAULT,
  SL_USBD_DEVICE_STATE_ADDRESSED,
  SL_USBD_DEVICE_STATE_CONFIGURED,
  SL_USBD_DEVICE_STATE_SUSPENDED
};

/********************************************************************************************************
 *                                       BUS EVENT DATA TYPE
 *******************************************************************************************************/

SL_ENUM(sl_usbd_bus_event_t) {
  SL_USBD_EVENT_BUS_CONNECT = 0,
  SL_USBD_EVENT_BUS_DISCONNECT,
  SL_USBD_EVENT_BUS_RESET,
  SL_USBD_EVENT_BUS_SUSPEND,
  SL_USBD_EVENT_BUS_RESUME
};

/****************************************************************************************************//**
 *                                      CONFIG EVENT DATA TYPE
 *******************************************************************************************************/

SL_ENUM(sl_usbd_config_event_t) {
  SL_USBD_EVENT_CONFIG_SET = 0,
  SL_USBD_EVENT_CONFIG_UNSET
};

/****************************************************************************************************//**
 *                                   USB DEVICE CONFIGURATION DATA TYPE
 *******************************************************************************************************/

typedef struct {
  uint16_t    vendor_id;                                      ///< Vendor  id.
  uint16_t    product_id;                                     ///< Product id.
  uint16_t    device_bcd;                                     ///< Device release number.
  const char  *manufacturer_str_ptr;                          ///< Manufacturer string.
  const char  *product_str_ptr;                               ///< Product      string.
  const char  *serial_nbr_str_ptr;                            ///< Serial Number id.
  uint16_t    lang_id;                                        ///< Language      id.
} sl_usbd_device_config_t;

/****************************************************************************************************//**
 *                           USB DEVICE MICROSOFT XTENDED PROPERTIES DATA TYPE
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
typedef struct {
  uint8_t       property_type;

  const uint8_t *property_name_ptr;
  uint16_t       property_name_len;

  const uint8_t *property_ptr;
  uint32_t       property_len;
} sl_usbd_microsoft_ext_property_t;
#endif

/****************************************************************************************************//**
 *                                           USB SETUP REQUEST
 *******************************************************************************************************/

typedef struct {
  uint8_t  bmRequestType;                                     ///< Characteristics of request.
  uint8_t  bRequest;                                          ///< Specific request.
  uint16_t wValue;                                            ///< Varies according to request.
  uint16_t wIndex;                                            ///< Varies according to request; typically used as index.
  uint16_t wLength;                                           ///< Transfer length if data stage present.
} sl_usbd_setup_req_t;

/****************************************************************************************************//**
 *                                       INTERFACE CLASS DRIVER
 *******************************************************************************************************/
typedef const struct {
  void (*enable)(uint8_t    cfg_nbr,
                 void       *p_if_class_arg);                                 ///< Notify class that cfg is active.

  void (*disable)(uint8_t    cfg_nbr,
                  void       *p_if_class_arg);                                ///< Notify class that cfg is not active.

  void (*alt_settings_update)(uint8_t    cfg_nbr,
                              uint8_t    if_nbr,
                              uint8_t    if_alt_nbr,
                              void       *p_if_class_arg,
                              void       *p_if_alt_class_arg);                ///< Notify class that alt setting has been updated.

  void (*endpoint_state_update)(uint8_t    cfg_nbr,
                                uint8_t    if_nbr,
                                uint8_t    if_alt_nbr,
                                uint8_t    ep_addr,
                                void       *p_if_class_arg,
                                void       *p_if_alt_class_arg);              ///< Notify class that EP state has been updated.

  void (*interface_descriptor)(uint8_t    cfg_nbr,
                               uint8_t    if_nbr,
                               uint8_t    if_alt_nbr,
                               void       *p_if_class_arg,
                               void       *p_if_alt_class_arg);               ///< Construct  IF functional descriptor.

  uint16_t (*interface_get_descriptor_size)(uint8_t    cfg_nbr,
                                            uint8_t    if_nbr,
                                            uint8_t    if_alt_nbr,
                                            void       *p_if_class_arg,
                                            void       *p_if_alt_class_arg);  ///< Get size of IF functional descriptor.

  void (*endpoint_descriptor)(uint8_t    cfg_nbr,
                              uint8_t    if_nbr,
                              uint8_t    if_alt_nbr,
                              uint8_t    ep_addr,
                              void       *p_if_class_arg,
                              void       *p_if_alt_class_arg);                ///< Construct  EP functional descriptor.

  uint16_t (*endpoint_get_descriptor_size)(uint8_t    cfg_nbr,
                                           uint8_t    if_nbr,
                                           uint8_t    if_alt_nbr,
                                           uint8_t    ep_addr,
                                           void       *p_if_class_arg,
                                           void       *p_if_alt_class_arg);   ///< Get size of EP functional descriptor.

  bool (*interface_req)(const sl_usbd_setup_req_t *p_setup_req,
                        void                      *p_if_class_arg);           ///< Interface request callback.

  bool (*class_req)(const sl_usbd_setup_req_t *p_setup_req,
                    void                      *p_if_class_arg);               ///< Class-specific  request callback.

  bool (*vendor_req)(const sl_usbd_setup_req_t *p_setup_req,
                     void                      *p_if_class_arg);              ///< Vendor-specific request callback.

#if (USBD_CFG_MS_OS_DESC_EN == 1)
  uint8_t (*microsoft_get_compat_id)(uint8_t *p_sub_compat_id_ix);                                                      ///< Get MS compatible id nbr.
  uint8_t (*microsoft_get_ext_property_table)(sl_usbd_microsoft_ext_property_t **pp_ext_property_tbl, uint8_t if_nbr);  ///< Get MS ext properties.
#endif
} sl_usbd_class_driver_t;

/********************************************************************************************************
 *                                       EP ASYNCHRONOUS CALLBACK API
 *******************************************************************************************************/

typedef void (*sl_usbd_async_function_t)(uint8_t      ep_addr,    // Endpoint address.
                                         void         *p_buf,     // Pointer to the buffer.
                                         uint32_t     buf_len,    // Buffer   length.
                                         uint32_t     xfer_len,   // Transfer length.
                                         void         *p_arg,     // Function argument.
                                         sl_status_t  status);    // Error status.

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL CONSTANTS
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               MACROS
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                               FRAME MACROS
 *
 * Note(s) : (1) This macro takes into account when the frame number rolls over upon reaching the maximum
 *               value of 2047.
 *******************************************************************************************************/

#define  SL_USBD_FRAME_NBR_GET(frame_nbr)                      ((frame_nbr) & SL_USBD_FRAME_NBR_MASK)

#define  SL_USBD_MICROFRAME_NBR_GET(microframe_nbr)            ((microframe_nbr) >> 11u)

//                                                                 See Note #1.
#define  SL_USBD_FRAME_NBR_DIFF_GET(frame_nbr1, frame_nbr2)    (((frame_nbr2) >= (frame_nbr1))  \
                                                                ? ((frame_nbr2) - (frame_nbr1)) \
                                                                : ((SL_USBD_FRAME_NBR_MAX + 1u + (frame_nbr2)) - (frame_nbr1)))

/********************************************************************************************************
 *                                       ENDPOINT CONVERSION MACROS
 *******************************************************************************************************/

#define  SL_USBD_ENDPOINT_PHY_TO_ADDR(ep_phy_nbr)                 ( ((ep_phy_nbr) / 2u) \
                                                                    | (((ep_phy_nbr) % 2u) ? SL_USBD_ENDPOINT_DIR_BIT : 0x00u))

#define  SL_USBD_ENDPOINT_ADDR_TO_PHY(ep_addr)                    ((((ep_addr) & SL_USBD_ENDPOINT_NBR_MASK) *  2u) \
                                                                   + ((((ep_addr) & SL_USBD_ENDPOINT_DIR_MASK) != 0u) ? 1u : 0u))

#define  SL_USBD_ENDPOINT_ADDR_TO_LOG(ep_addr)                    (uint8_t)((ep_addr) & SL_USBD_ENDPOINT_NBR_MASK)

#define  SL_USBD_ENDPOINT_PHY_TO_LOG(ep_phy_nbr)                  (ep_phy_nbr / 2u)

#define  SL_USBD_ENDPOINT_LOG_TO_ADDR_IN(ep_log_nbr)              ((ep_log_nbr) | SL_USBD_ENDPOINT_DIR_IN)

#define  SL_USBD_ENDPOINT_LOG_TO_ADDR_OUT(ep_log_nbr)             ((ep_log_nbr) | SL_USBD_ENDPOINT_DIR_OUT)

