espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_core.h
#define  SL_USBD_ENDPOINT_IS_IN(ep_addr)                          ((((ep_addr) & SL_USBD_ENDPOINT_DIR_MASK) != 0u) ? true : false)

/********************************************************************************************************
 ********************************************************************************************************
 *                                           FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                   CONFIGURATION OVERRIDE FUNCTIONS
 *******************************************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/********************************************************************************************************
 *                                           USBD CORE FUNCTIONS
 *
 * Note(s) : (1) USB Spec 2.0, Section 5.5 states "Control transfers allow access to different parts of
 *               a device.  Control transfers are intended to support configuration/command/status type
 *               communication flows between client software and its function".
 *
 *               (a) "Each USB device is required to implement the Default Control Pipe as a message
 *                       pipe.  This pipe is used by the USB System Software.  The Default Control Pipe
 *                       provides access to the USB device's configuration, status, and control information".
 *
 *                   The 'sl_usbd_core_ep_XXXX()' functions perform operations in the default endpoint.
 *                   Class drivers should use 'sl_usbd_core_ep_XXXX()' to send/receive class specific requests.
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                                 sl_usbd_core_init()
 *
 * @brief    Initialize the USB device stack.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) sli_usbd_core_init_internals() MUST be called ... :
 *               - (a) ONLY ONCE from a product's application;
 *               - (b) With the following conditions:
 *                   - (1) AFTER  the product's OS has been initialized.
 *                   - (2) BEFORE the product's application calls any USB device stack function(s).
 *******************************************************************************************************/
sl_status_t sl_usbd_core_init(void);

/****************************************************************************************************//**
 * @brief    Start the device stack.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Device stack can be only started if the device is in one of the following states:
 *               - SL_USBD_DEVICE_STATE_NONE    Device controller has not been initialized.
 *               - SL_USBD_DEVICE_STATE_INIT    Device controller is already   initialized.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_start_device(void);

/****************************************************************************************************//**
 * @brief    Stop the device stack.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_stop_device(void);

/****************************************************************************************************//**
 * @brief    Get the current device state.
 *
 * @param    p_dev_state   Pointer to device state to be returned.
 *                         Set to current device state, if no errors are returned,
 *                         or SL_USBD_DEVICE_STATE_NONE,  if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_state(sl_usbd_device_state_t *p_dev_state);

/****************************************************************************************************//**
 * @brief    Get device speed.
 *
 * @param    p_dev_speed   Pointer to the variable that will be set to device speed upon return.
 *                         It will be set to current device speed, if successful,
 *                         or SL_USBD_DEVICE_SPEED_INVALID,     if unsuccessful.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_speed(sl_usbd_device_speed_t *p_dev_speed);

/****************************************************************************************************//**
 * @brief    Set the device's current power source.
 *
 * @param    self_pwr    The power source of the device :
 *                           - true  device is self-powered.
 *                           - false device is  bus-powered.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_set_device_self_power(bool self_pwr);

/****************************************************************************************************//**
 * @brief    Set the device's Microsoft vendor code.
 *
 * @param    vendor_code     Microsoft vendor code.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) The vendor code used MUST be different from any vendor bRequest value.
 *******************************************************************************************************/
#if (USBD_CFG_MS_OS_DESC_EN == 1)
sl_status_t sl_usbd_core_set_device_microsoft_vendor_code(uint8_t vendor_code);
#endif

/****************************************************************************************************//**
 * @brief    Get the device configuration.
 *
 * @param    p_dev_cfg   Pointer to a variable of type (sl_usbd_device_config_t *) which will receive
 *                       the memory address of device configuration structure upon return.
 *                       The variable will be set to point to device configuration, if no errors are returned,
 *                       or it will be set to NULL if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_configuration(sl_usbd_device_config_t **p_dev_cfg);

/****************************************************************************************************//**
 * @brief    Get the last frame number from the driver.
 *
 * @param    p_frame_nbr  Pointer to variable that will receive frame number.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) The frame number will always be in the range of 0-2047 (11 bits).
 *
 * @note     (2) Frame number returned to the caller contains the frame and microframe numbers. It is
 *               encoded following this 16-bit format:
 *               @verbatim
 *               | 15 | 14 | 13 | 12 | 11 | 10 | 9 | 8 | 7 | 6 | 5 | 4 | 3 | 2 | 1 | 0 |
 *               |  0    0 |  microframe  |                  frame                     |
 *               @endverbatim
 *               Caller must use the macros SL_USBD_FRAME_NBR_GET() or SL_USBD_MICROFRAME_NBR_GET() to get
 *               the frame or microframe number only.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_frame_number(uint16_t *p_frame_nbr);

/****************************************************************************************************//**
 * @brief    Add a configuration attribute to the device.
 *
 * @param    attrib      Available configuration attributes.
 *                           - SL_USBD_DEV_ATTRIB_SELF_POWERED      Power does not come from VBUS.
 *                           - SL_USBD_DEV_ATTRIB_REMOTE_WAKEUP     Remote wakeup feature enabled.
 *
 * @param    max_pwr     Bus power required for this device (see Note #1).
 *
 * @param    spd         Available configuration speeds.
 *                           - SL_USBD_DEVICE_SPEED_FULL   Configuration is added in the full-speed configuration set.
 *
 * @param    p_name      Pointer to string describing the configuration (see Note #2).
 *
 * @param    p_cfg_nbr   Pointer to variable that will receive the configuration number.
 *                       It will be set to the configuration number, if no errors are returned,
 *                       otherwise it will be set to SL_USBD_CONFIG_NBR_NONE if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB spec 2.0 (section 7.2.1.3/4) defines power constraints for bus-powered devices:
 *               "A low-power function draws up to one unit load from the USB cable when operational"
 *               "A function is high-power if, when fully powered, draws over one, but no more than
 *               five, unit loads from the USB cable."
 *               A unit load is defined as 100mA, so 'max_pwr' argument should be between 0 mA
 *               and 500mA
 *
 * @note     (2) String support is optional: 'p_name' can be a NULL string pointer.
 *
 * @note     (3) Configuration can only be added when the device is in the following states:
 *                   - SL_USBD_DEVICE_STATE_NONE    Device controller has not been initialized.
 *                   - SL_USBD_DEVICE_STATE_INIT    Device controller is already   initialized.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_configuration(uint8_t                  attrib,
                                           uint16_t                 max_pwr,
                                           sl_usbd_device_speed_t   spd,
                                           const char               *p_name,
                                           uint8_t                  *p_cfg_nbr);

/****************************************************************************************************//**
 * @brief    Associate a configuration with its alternative-speed counterpart.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    config_other    Other-speed configuration number.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Configurations from high- and full-speed can be associated with each other to provide
 *               comparable functionality regardless of speed.
 *
 * @note     (2) Configuration can ONLY be associated when the device is in the following states:
 *                   - SL_USBD_DEVICE_STATE_NONE    Device controller has not been initialized.
 *                   - SL_USBD_DEVICE_STATE_INIT    Device controller is already   initialized.
 *******************************************************************************************************/
#if (USBD_CFG_HS_EN == 1)
sl_status_t sl_usbd_core_associate_other_speed_configuration(uint8_t cfg_nbr,
                                                             uint8_t cfg_other);
#endif

/****************************************************************************************************//**
 * @brief    Add an interface to a specific configuration.
 *
 * @param    cfg_nbr                 Configuration index to add the interface.
 *
 * @param    p_class_drv             Pointer to interface driver.
 *
 * @param    p_if_class_arg          Pointer to interface driver argument.
 *
 * @param    p_if_alt_class_arg      Pointer to alternate interface argument.
 *
 * @param    class_code              Class code assigned by the USB-IF.
 *
 * @param    class_sub_code          Subclass code assigned by the USB-IF.
 *
 * @param    class_protocol_code     protocol code assigned by the USB-IF.
 *
 * @param    p_name                  Pointer to string describing the Interface.
 *
 * @param    p_if_nbr                Pointer to a variable that will receive interface number after creation.
 *                                   The variable will be set to the interface number, if no errors are returned,
 *                                   otherwise it is set to SL_USBD_INTERFACE_NBR_NONE.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB Spec 2.0 Interface (section 9.6.5) states: "An interface may include alternate
 *               settings that allow the endpoints and/or their characteristics to be varied after
 *               the device has been configured. The default setting for an interface is always
 *               an alternate setting of zero."
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_interface(uint8_t                cfg_nbr,
                                       sl_usbd_class_driver_t *p_class_drv,
                                       void                   *p_if_class_arg,
                                       void                   *p_if_alt_class_arg,
                                       uint8_t                class_code,
                                       uint8_t                class_sub_code,
                                       uint8_t                class_protocol_code,
                                       const char             *p_name,
                                       uint8_t                *p_if_nbr);

/****************************************************************************************************//**
 * @brief    Add an alternate setting to a specific interface.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    if_nbr          Interface number.
 *
 * @param    p_class_arg     Pointer to alternate interface argument.
 *
 * @param    p_name          Pointer to alternate setting name.
 *
 * @param    p_if_alt_nbr    Pointer to variable that will receive alternate setting number upon return.
 *                           It will be set to interface alternate setting number if no error(s) are returned,
 *                           or SL_USBD_ALT_INTERFACE_NBR_NONE if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_alt_interface(uint8_t        config_nbr,
                                           uint8_t        if_nbr,
                                           void           *p_class_arg,
                                           const char     *p_name,
                                           uint8_t        *p_if_alt_nbr);

/****************************************************************************************************//**
 * @brief    Create an interface group.
 *
 * @param    config_nbr              Configuration number.
 *
 * @param    class_code              Class code assigned by the USB-IF.
 *
 * @param    class_sub_code          Subclass code assigned by the USB-IF.
 *
 * @param    class_protocol_code     protocol code assigned by the USB-IF.
 *
 * @param    if_start                Interface number of the first interface that is associated with this group.
 *
 * @param    if_cnt                  Number of consecutive interfaces that are associated with this group.
 *
 * @param    p_name                  Pointer to the string that describes the interface group.
 *
 * @param    p_if_grp_num            Pointer to the variable that will receive interface group number upon return.
 *                                   The variable is set to interface group number if no errors are returned,
 *                                   or SL_USBD_INTERFACE_GROUP_NBR_NONE if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_interface_group(uint8_t      config_nbr,
                                             uint8_t      class_code,
                                             uint8_t      class_sub_code,
                                             uint8_t      class_protocol_code,
                                             uint8_t      if_start,
                                             uint8_t      if_cnt,
                                             const char   *p_name,
                                             uint8_t      *p_if_grp_num);

/****************************************************************************************************//**
 * @brief    Get the device descriptor.
 *
 * @param    p_buf       Pointer to the destination buffer.
 *
 * @param    max_len     Maximum number of bytes to write in destination buffer.
 *
 * @param    p_desc_len  Pointer to a variable that will receive the actual size of the descriptor.
 *                       The variable is set to number of bytes actually in the descriptor if no errors
 *                       are returned, or set to 0 if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function should be used by drivers that supporting the standard requests auto-reply,
 *               (during the initialization process).
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_device_descriptor(uint8_t *p_buf,
                                               uint8_t max_len,
                                               uint8_t *p_desc_len);

/****************************************************************************************************//**
 * @brief    Get a configuration descriptor.
 *
 * @param    p_buf       Pointer to the destination buffer.
 *
 * @param    max_len     Maximum number of bytes to write in the destination buffer.
 *
 * @param    config_ix   Index of the desired configuration descriptor.
 *
 * @param    p_desc_len  Pointer to a variable that will receive the actual size of the descriptor.
 *                       The variable is set to number of bytes actually in the descriptor if no errors
 *                       are returned, or set to 0 if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function should be used by drivers supporting a standard request's auto-reply,
 *               during the initialization process.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_configuration_descriptor(uint8_t  *p_buf,
                                                      uint16_t max_len,
                                                      uint8_t  config_ix,
                                                      uint16_t *p_desc_len);

/****************************************************************************************************//**
 * @brief    Get a string descriptor.
 *
 * @param    p_buf       Pointer to the destination buffer.
 *
 * @param    max_len     Maximum number of bytes to write in destination buffer.
 *
 * @param    str_ix      Index of the desired string descriptor.
 *
 * @param    p_desc_len  Pointer to a variable that will receive the actual size of the descriptor.
 *                       The variable is set to number of bytes actually in the descriptor if no errors
 *                       are returned, or set to 0 if any errors are returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function should be used by drivers supporting a standard request's auto-reply,
 *               during the initialization process.
 *******************************************************************************************************/
#if (USBD_CFG_STR_EN == 1)
sl_status_t sl_usbd_core_get_string_descriptor(uint8_t  *p_buf,
                                               uint8_t  max_len,
                                               uint8_t  str_ix,
                                               uint8_t  *p_desc_len);
#endif

/****************************************************************************************************//**
 * @brief    Add string to USB device.
 *
 * @param    p_str       Pointer to string to add (see Note #1).
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB spec 2.0 chapter 9.5 states: "Where appropriate, descriptors contain references
 *               to string descriptors that provide displayable information describing a descriptor
 *               in human-readable form. The inclusion of string descriptors is optional.  However,
 *               the reference fields within descriptors are mandatory. If a device does not support
 *               string descriptors, string reference fields must be reset to zero to indicate no
 *               string descriptor is available".
 *               Since string descriptors are optional, 'p_str' could be a NULL pointer.
 *******************************************************************************************************/
#if (USBD_CFG_STR_EN == 1)
sl_status_t sl_usbd_core_add_string(const char *p_str);
#endif

/****************************************************************************************************//**
 * @brief    Get string index corresponding to a given string.
 *
 * @param    p_str       Pointer to string.
 *
 * @param    p_str_ix    Pointer to variable where string index will be returned.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
#if (USBD_CFG_STR_EN == 1)
sl_status_t sl_usbd_core_get_string_index(const char *p_str,
                                          uint8_t    *p_str_ix);
#endif

/****************************************************************************************************//**
 * @brief    Write an 8-bit value to the descriptor buffer.
 *
 * @param    val         8-bit value to write in the descriptor buffer.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB classes may use this function to append class-specific descriptors to the
 *               configuration descriptor.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_08b_to_descriptor_buf(uint8_t val);

