espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_core.h
/****************************************************************************************************//**
 * @brief    Write a 16-bit value in the descriptor buffer.
 *
 * @param    val     16-bit value.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB classes may use this function to append class-specific descriptors to the
 *               configuration descriptor.
 *
 * @note     (2) USB descriptors are in little-endian format.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_16b_to_descriptor_buf(uint16_t val);

/****************************************************************************************************//**
 * @brief    Write a 24-bit value to the descriptor buffer.
 *
 * @param    val         32-bit value containing 24 useful bits to write in the descriptor buffer.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB classes may use this function to append class-specific descriptors to the
 *               configuration descriptor.
 *
 * @note     (2) USB descriptors are in little-endian format.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_24b_to_descriptor_buf(uint32_t val);

/****************************************************************************************************//**
 * @brief    Write a 32-bit value to the descriptor buffer.
 *
 * @param    val         32-bit value to write in the descriptor buffer.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB classes may use this function to append class-specific descriptors to the
 *               configuration descriptor.
 *
 * @note     (2) USB descriptors are in little-endian format.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_32b_to_descriptor_buf(uint32_t val);

/****************************************************************************************************//**
 * @brief    Write a buffer into the descriptor buffer.
 *
 * @param    p_buf       Pointer to the buffer to write into the descriptor buffer.
 *
 * @param    len         Length of the buffer.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) USB classes may use this function to append class-specific descriptors to the
 *               configuration descriptor.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_buf_to_descriptor_buf(const uint8_t  *p_buf,
                                                     uint16_t       len);

/****************************************************************************************************//**
 * @brief    Send data on the Control IN endpoint.
 *
 * @param    p_buf       Pointer to the buffer of data that will be sent (see Note #2).
 *
 * @param    buf_len     Number of octets to transmit.
 *
 * @param    timeout_ms  Timeout in milliseconds.
 *
 * @param    end         End-of-transfer flag (see Note #1).
 *
 * @param    p_xfer_len  Pointer to a variable that will be set to the number of octets transmitted.
 *                       The variable is set to the number of octets transmitted if no errors are returned,
 *                       otherwise it is set to 0.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) If end-of-transfer is set and transfer length is multiple of maximum packet size,
 *               a zero-length packet is transferred to indicate a short transfer to the host.
 *
 * @note     (2) Transmit buffer must be 32 bits aligned.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_control_sync(void        *p_buf,
                                            uint32_t    buf_len,
                                            uint16_t    timeout_ms,
                                            bool        end,
                                            uint32_t    *p_xfer_len);

/****************************************************************************************************//**
 * @brief    Receive data on the Control OUT endpoint.
 *
 * @param    p_buf       Pointer to the destination buffer to receive data (see Note #1).
 *
 * @param    buf_len     Number of octets to receive.
 *
 * @param    timeout_ms  Timeout in milliseconds.
 *
 * @param    p_xfer_len  Pointer to a variable that will be set to the number of octets received.
 *                       The variable is set to the number of octets received if no errors are returned,
 *                       otherwise it is set to 0.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Receive buffer must be 32 bits aligned.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_read_control_sync(void       *p_buf,
                                           uint32_t   buf_len,
                                           uint16_t   timeout_ms,
                                           uint32_t   *p_xfer_len);

/****************************************************************************************************//**
 * @brief    Add a bulk endpoint to alternate setting interface.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    if_nbr          Interface number.
 *
 * @param    if_alt_nbr      Interface alternate setting number.
 *
 * @param    dir_in          Endpoint direction.
 *                               - true      IN   direction.
 *                               - false     OUT  direction.
 *
 * @param    max_pkt_len     Endpoint maximum packet length (see Note #1)
 *
 * @param    p_ep_addr       Pointer to a variable that will receive the new endpoint address.
 *                           The variable will be set to endpoint address if no errors are returned,
 *                           otherwise it will be set to SL_USBD_ENDPOINT_ADDR_NONE.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) If the 'max_pkt_len' argument is '0', the stack will allocate the first available
 *               BULK endpoint, regardless its maximum packet size.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_bulk_endpoint(uint8_t   config_nbr,
                                           uint8_t   if_nbr,
                                           uint8_t   if_alt_nbr,
                                           bool      dir_in,
                                           uint16_t  max_pkt_len,
                                           uint8_t   *p_ep_addr);

/****************************************************************************************************//**
 * @brief    Receive data on Bulk OUT endpoint.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the destination buffer to receive data (see Note #1).
 *
 * @param    buf_len     Number of octets to receive.
 *
 * @param    timeout_ms  Timeout in milliseconds.
 *
 * @param    p_xfer_len  Pointer to a variable that will be set to the number of octets received.
 *                       The variable is set to the number of octets received if no errors are returned,
 *                       otherwise it is set to 0.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Receive buffer must be 32 bits aligned.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_read_bulk_sync(uint8_t  ep_addr,
                                        void     *p_buf,
                                        uint32_t buf_len,
                                        uint16_t timeout_ms,
                                        uint32_t *p_xfer_len);

/****************************************************************************************************//**
 * @brief    Receive data on Bulk OUT endpoint asynchronously.
 *
 * @param    ep_addr         Endpoint address.
 *
 * @param    p_buf           Pointer to the destination buffer to receive data (see Note #1).
 *
 * @param    buf_len         Number of octets to receive.
 *
 * @param    async_fnct      Function that will be invoked upon completion of receive operation.
 *
 * @param    p_async_arg     Pointer to the argument that will be passed as parameter of 'async_fnct'.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Receive buffer must be 32 bits aligned.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_read_bulk_async(uint8_t                  ep_addr,
                                         void                     *p_buf,
                                         uint32_t                 buf_len,
                                         sl_usbd_async_function_t async_fnct,
                                         void                     *p_async_arg);

/****************************************************************************************************//**
 * @brief    Send data on a Bulk IN endpoint.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to buffer of data that will be transmitted (see Note #2).
 *
 * @param    buf_len     Number of octets to transmit.
 *
 * @param    timeout_ms  Timeout in milliseconds.
 *
 * @param    end         End-of-transfer flag (see Note #3).
 *
 * @param    p_xfer_len  Pointer to a variable that will receive the number of octets transmitted.
 *                       The variable is set to the number of octets transmitted if no errors are
 *                       returned, otherwise it is set to 0.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function SHOULD NOT be called from interrupt service routine (ISR).
 *
 * @note     (2) Transmit buffer must be 32 bits aligned.
 *
 * @note     (3) If end-of-transfer is set and transfer length is multiple of maximum packet sizes,
 *               a zero-length packet is transferred to indicate a short transfer to the host.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_bulk_sync(uint8_t   ep_addr,
                                         void      *p_buf,
                                         uint32_t  buf_len,
                                         uint16_t  timeout_ms,
                                         bool      end,
                                         uint32_t  *p_xfer_len);

/****************************************************************************************************//**
 * @brief    Send data on the Bulk IN endpoint asynchronously.
 *
 * @param    ep_addr         Endpoint address.
 *
 * @param    p_buf           Pointer to the buffer of data that will be transmitted (see Note #1).
 *
 * @param    buf_len         Number of octets to transmit.
 *
 * @param    async_fnct      Function that will be invoked upon completion of transmit operation.
 *
 * @param    p_async_arg     Pointer to the argument that will be passed as parameter of 'async_fnct'.
 *
 * @param    end             End-of-transfer flag (see Note #2).
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Transmit buffer must be 32 bits aligned.
 *
 * @note     (2) If end-of-transfer is set and transfer length is multiple of maximum packet size,
 *               a zero-length packet is transferred to indicate a short transfer to the host.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_bulk_async(uint8_t                   ep_addr,
                                          void                      *p_buf,
                                          uint32_t                  buf_len,
                                          sl_usbd_async_function_t  async_fnct,
                                          void                      *p_async_arg,
                                          bool                      end);

/****************************************************************************************************//**
 * @brief    Add an interrupt endpoint to an alternate setting interface.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    if_nbr          Interface number.
 *
 * @param    if_alt_nbr      Interface alternate setting number.
 *
 * @param    dir_in          Endpoint Direction.
 *                               - true      IN   direction.
 *                               - false     OUT  direction.
 *
 * @param    max_pkt_len     Endpoint maximum packet length. (see Note #1)
 *
 * @param    interval        Endpoint interval in frames or microframes.
 *
 * @param    p_ep_addr       Pointer to a variable that will receive the new endpoint address.
 *                           The variable will be set to endpoint address if no errors are returned,
 *                           otherwise it will be set to SL_USBD_ENDPOINT_ADDR_NONE.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) If the 'max_pkt_len' argument is '0', the stack will allocate the first available
 *               INTERRUPT endpoint, regardless its maximum packet size.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_add_interrupt_endpoint(uint8_t    config_nbr,
                                                uint8_t    if_nbr,
                                                uint8_t    if_alt_nbr,
                                                bool       dir_in,
                                                uint16_t   max_pkt_len,
                                                uint16_t   interval,
                                                uint8_t    *p_ep_addr);

/****************************************************************************************************//**
 * @brief    Receive data on the Interrupt OUT endpoint.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the destination buffer to receive data (see Note #2).
 *
 * @param    buf_len     Number of octets to receive.
 *
 * @param    timeout_ms  Timeout in milliseconds.
 *
 * @param    p_xfer_len  Pointer to a variable that will be set to the number of octets received.
 *                       The variable is set to the number of octets received if no errors are returned,
 *                       otherwise it is set to 0.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function SHOULD NOT be called from interrupt service routine (ISR).
 *
 * @note     (2) Receive buffer must be 32 bits aligned.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_read_interrupt_sync(uint8_t  ep_addr,
                                             void     *p_buf,
                                             uint32_t buf_len,
                                             uint16_t timeout_ms,
                                             uint32_t *p_xfer_len);

/****************************************************************************************************//**
 * @brief    Receive data on Interrupt OUT endpoint asynchronously.
 *
 * @param    ep_addr         Endpoint address.
 *
 * @param    p_buf           Pointer to the destination buffer to receive data (see Note #1).
 *
 * @param    buf_len         Number of octets to receive.
 *
 * @param    async_fnct      Function that will be invoked upon completion of receive operation.
 *
 * @param    p_async_arg     Pointer to argument that will be passed as parameter of 'async_fnct'.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Receive buffer must be 32 bits aligned.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_read_interrupt_async(uint8_t                  ep_addr,
                                              void                     *p_buf,
                                              uint32_t                 buf_len,
                                              sl_usbd_async_function_t async_fnct,
                                              void                     *p_async_arg);

/****************************************************************************************************//**
 * @brief    Send data on Interrupt IN endpoint.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the buffer of data that will be transmitted (see Note #2).
 *
 * @param    buf_len     Number of octets to transmit.
 *
 * @param    timeout_ms  Timeout in milliseconds.
 *
 * @param    end         End-of-transfer flag (see Note #3).
 *
 * @param    p_xfer_len  Pointer to a variable that will be set to the number of octets transmitted.
 *                       The variable is set to the number of octets transmitted if no errors are returned,
 *                       otherwise it is set to 0.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function SHOULD NOT be called from interrupt service routine (ISR).
 *
 * @note     (2) Transmit buffer must be 32 bits aligned.
 *
 * @note     (3) If end-of-transfer is set and transfer length is multiple of maximum packet size,
 *               a zero-length packet is transferred to indicate a short transfer to the host.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_interrupt_sync(uint8_t   ep_addr,
                                              void      *p_buf,
                                              uint32_t  buf_len,
                                              uint16_t  timeout_ms,
                                              bool      end,
                                              uint32_t  *p_xfer_len);

/****************************************************************************************************//**
 * @brief    Send data on the Interrupt IN endpoint asynchronously.
 *
 * @param    ep_addr         Endpoint address.
 *
 * @param    p_buf           Pointer to the buffer of data that will be transmitted (see Note #1).
 *
 * @param    buf_len         Number of octets to transmit.
 *
 * @param    async_fnct      Function that will be invoked upon completion of transmit operation.
 *
 * @param    p_async_arg     Pointer to the argument that will be passed as parameter of 'async_fnct'.
 *
 * @param    end             End-of-transfer flag (see Note #2).
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Transmit buffer must be 32 bits aligned.
 *
 * @note     (2) If end-of-transfer is set and transfer length is multiple of maximum packet size,
 *               a zero-length packet is transferred to indicate a short transfer to the host.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_write_interrupt_async(uint8_t                  ep_addr,
                                               void                     *p_buf,
                                               uint32_t                 buf_len,
                                               sl_usbd_async_function_t async_fnct,
                                               void                     *p_async_arg,
                                               bool                     end);

/****************************************************************************************************//**
 * @brief    Add an isochronous endpoint to alternate setting interface.
 *
 * @param    config_nbr          Configuration number.
 *
 * @param    if_nbr              Interface number.
 *
 * @param    if_alt_nbr          Interface alternate setting number.
 *
 * @param    dir_in              Endpoint Direction :
 *                                   - true,      IN  direction.
 *                                   - false,     OUT direction.
 *
 * @param    attrib              Isochronous endpoint synchronization and usage type attributes.
 *
 * @param    max_pkt_len         Endpoint maximum packet length (see Note #1).
 *
 * @param    transaction_frame   Endpoint transactions per (micro)frame (see Note #2).
 *
 * @param    interval            Endpoint interval in frames or microframes.
 *
 * @param    p_ep_addr           Pointer to a variable that will receive the new endpoint address.
 *                               The variable will be set to endpoint address if no errors are returned,
 *                               otherwise it will be set to SL_USBD_ENDPOINT_ADDR_NONE.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) If the 'max_pkt_len' argument is '0', the stack allocates the first available
 *               ISOCHRONOUS endpoint regardless of its maximum packet size.
 *
 * @note     (2) For full-speed endpoints, 'transaction_frame' must be set to 1 since there is no
 *               support for high-bandwidth endpoints.
 *
 * @note     (3) For full-/high-speed isochronous endpoints, bInterval value must be in the range
 *               from 1 to 16. The bInterval value is used as the exponent for a 2^(bInterval-1)
 *               value. Maximum polling interval value is 2^(16-1) = 32768 frames in full-speed and
 *               32768 microframes (i.e., 4096 frames) in high-speed.
 *******************************************************************************************************/
#if (USBD_CFG_EP_ISOC_EN == 1)
sl_status_t sl_usbd_core_add_isochronous_endpoint(uint8_t    config_nbr,
                                                  uint8_t    if_nbr,
                                                  uint8_t    if_alt_nbr,
                                                  bool       dir_in,
                                                  uint8_t    attrib,
                                                  uint16_t   max_pkt_len,
                                                  uint8_t    transaction_frame,
                                                  uint16_t   interval,
                                                  uint8_t    *p_ep_addr);
#endif

