espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_core.h
/****************************************************************************************************//**
 * @brief    Receive data on an isochronous OUT endpoint asynchronously.
 *
 * @param    ep_addr         Endpoint address.
 *
 * @param    p_buf           Pointer to the destination buffer to receive data (see Note #1).
 *
 * @param    buf_len         Number of octets to receive.
 *
 * @param    async_fnct      Function that will be invoked upon completion of a receive operation.
 *
 * @param    p_async_arg     Pointer to the argument that will be passed as parameter of 'async_fnct'.
 *
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Receive buffer must be 32 bits aligned.
 *******************************************************************************************************/
#if (USBD_CFG_EP_ISOC_EN == 1)
sl_status_t sl_usbd_core_read_isochronous_async(uint8_t                   ep_addr,
                                                void                      *p_buf,
                                                uint32_t                  buf_len,
                                                sl_usbd_async_function_t  async_fnct,
                                                void                      *p_async_arg);
#endif

/****************************************************************************************************//**
 * @brief    Send data on an isochronous IN endpoint asynchronously.

 * @param    ep_addr         Endpoint address.
 *
 * @param    p_buf           Pointer to the buffer of data that will be transmitted (see Note #1).
 *
 * @param    buf_len         Number of octets to transmit.
 *
 * @param    async_fnct      Function that will be invoked upon completion of transmit operation.
 *
 * @param    p_async_arg     Pointer to the argument that will be passed as parameter of 'async_fnct'.
 *
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Transmit buffer must be 32 bits aligned.
 *******************************************************************************************************/
#if (USBD_CFG_EP_ISOC_EN == 1)
sl_status_t sl_usbd_core_write_isochronous_async(uint8_t                  ep_addr,
                                                 void                     *p_buf,
                                                 uint32_t                 buf_len,
                                                 sl_usbd_async_function_t async_fnct,
                                                 void                     *p_async_arg);
#endif

/****************************************************************************************************//**
 * @brief    Set synchronization feedback rate on synchronization isochronous endpoint.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    if_nbr          Interface number.
 *
 * @param    if_alt_nbr      Interface alternate setting number.
 *
 * @param    synch_ep_addr   Synchronization endpoint address.
 *
 * @param    sync_refresh    Exponent of synchronization feedback rate (see Note #3).
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Synchronization endpoints can ONLY be associated when the device is in the following
 *               states:
 *                   - SL_USBD_DEVICE_STATE_NONE    Device controller has not been initialized.
 *                   - SL_USBD_DEVICE_STATE_INIT    Device controller is already      initialized.
 *
 * @note     (2) For audio class 1.0, the interface class code must be SL_USBD_CLASS_CODE_AUDIO and
 *               protocol 'zero'
 *
 * @note     (3) If explicit synchronization mechanism is needed to maintain synchronization during
 *               transfers, the information carried over the synchronization path must be available
 *               every 2 ^ (10 - P) frames, with P ranging from 1 to 9 (512 ms down to 2 ms).
 *
 * @note     (4) Table 4-22 "Standard AS Isochronous Synch Endpoint Descriptor" of Audio 1.0
 *               specification indicates for bmAttributes field no usage type for bits 5..4. But
 *               USB 2.0 specification, Table 9-13 "Standard Endpoint Descriptor" indicates several
 *               types of usage. When an explicit feedback is defined for a asynchronous isochronous
 *               endpoint, the associated synch feedback should use the Usage type 'Feedback endpoint'.
 *******************************************************************************************************/
#if (USBD_CFG_EP_ISOC_EN == 1)
sl_status_t sl_usbd_core_set_isochronous_endpoint_refresh_rate(uint8_t config_nbr,
                                                               uint8_t if_nbr,
                                                               uint8_t if_alt_nbr,
                                                               uint8_t synch_ep_addr,
                                                               uint8_t sync_refresh);
#endif

/****************************************************************************************************//**
 * @brief    Associate synchronization endpoint to isochronous endpoint.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    if_nbr          Interface number.
 *
 * @param    if_alt_nbr      Interface alternate setting number.
 *
 * @param    data_ep_addr    Data endpoint address.
 *
 * @param    sync_addr       Associated synchronization endpoint.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) Synchronization endpoints can ONLY be associated when the device is in the following
 *               states:
 *                   - SL_USBD_DEVICE_STATE_NONE    Device controller has not been initialized.
 *                   - SL_USBD_DEVICE_STATE_INIT    Device controller is already      initialized.
 *
 * @note     (2) For audio class 1.0, interface class code must be SL_USBD_CLASS_CODE_AUDIO and protocol
 *               'zero'.
 *******************************************************************************************************/
#if (USBD_CFG_EP_ISOC_EN == 1)
sl_status_t sl_usbd_core_set_isochronous_endpoint_sync_address(uint8_t config_nbr,
                                                               uint8_t if_nbr,
                                                               uint8_t if_alt_nbr,
                                                               uint8_t data_ep_addr,
                                                               uint8_t sync_addr);
#endif

/****************************************************************************************************//**
 * @brief    Send zero-length packet to the host.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    timeout_ms  Timeout in milliseconds.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function should only be called during a synchronous transfer.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_endpoint_write_zlp(uint8_t  ep_addr,
                                            uint16_t timeout_ms);

/****************************************************************************************************//**
 * @brief    Receive zero-length packet from the host.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    timeout_ms  Timeout in milliseconds.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function should only be called during a synchronous transfer.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_endpoint_read_zlp(uint8_t  ep_addr,
                                           uint16_t timeout_ms);

/****************************************************************************************************//**
 * @brief    Abort I/O transfer on the endpoint.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_abort_endpoint(uint8_t ep_addr);

/****************************************************************************************************//**
 * @brief    Notify USB stack that packet receive has completed.
 *
 * @param    ep_log_nbr  Endpoint logical number.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_endpoint_read_complete(uint8_t ep_log_nbr);

/****************************************************************************************************//**
 * @brief    Notify USB stack that packet transmit has completed.
 *
 * @param    ep_log_nbr  Endpoint logical number.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_endpoint_write_complete(uint8_t ep_log_nbr);

/****************************************************************************************************//**
 * @brief    Notify USB stack that packet transmit has completed (see Note #1).
 *
 * @param    ep_log_nbr  Endpoint logical number.
 *
 * @param    xfer_err    Error code returned by the USB driver.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *
 * @note     (1) This function is an alternative to the function sl_usbd_core_endpoint_write_complete() so that a USB device
 *               driver can return to the core an error code upon the Tx transfer completion.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_endpoint_write_complete_extended(uint8_t      ep_log_nbr,
                                                          sl_status_t  xfer_err);

/****************************************************************************************************//**
 * @brief    Stall the non-control endpoint.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    state       Endpoint stall state.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_stall_endpoint(uint8_t  ep_addr,
                                        bool     state);

/****************************************************************************************************//**
 * @brief    Get the stall status of a non-control endpoint.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_ep_stall  Pointer to a boolean that will receive the endpoint stalled status.
 *                       The boolean variable is set to true if endpoint is stalled,
 *                       or is set to false if endpoint is not stalled.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_is_endpoint_stalled(uint8_t  ep_addr,
                                             bool     *p_ep_stall);

/****************************************************************************************************//**
 * @brief    Retrieve the endpoint maximum packet size.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_max_size  Pointer to a variable that will receive the maximum packet size upon return.
 *                       The variable is set to the maximum packet size if no errors are returned,
 *                       otherwise it is set to 0.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_max_endpoint_packet_size(uint8_t  ep_addr,
                                                      uint16_t *p_max_size);

/****************************************************************************************************//**
 * @brief    Get the maximum physical endpoint number.
 *
 * @param    p_ep_phy_nbr  Pointer to variable where maximum physical endpoint number will be returned.
 *                         If no errors are returned, the variable will be set to maximum physical endpoint
 *                         number, otherwise it will be set to SL_USBD_ENDPOINT_PHY_NONE.
 *
 * @return   Returns SL_STATUS_OK on success or another SL_STATUS code on failure.
 *******************************************************************************************************/
sl_status_t sl_usbd_core_get_max_phy_endpoint_number(uint8_t *p_ep_phy_nbr);

