espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/inc/sl_usbd_core.h
sl_status_t sl_usbd_core_get_max_open_endpoint_number(uint8_t *p_nbr_open);

//                                                                 ------------------ EVENT HANDLERS ------------------
__WEAK void sl_usbd_on_bus_event(sl_usbd_bus_event_t event);

__WEAK void sl_usbd_on_config_event(sl_usbd_config_event_t event,
                                    uint8_t                config_nbr);

#ifdef __cplusplus
}
#endif

/********************************************************************************************************
 ********************************************************************************************************
 *                                           CONFIGURATION ERRORS
 ********************************************************************************************************
 *******************************************************************************************************/

#ifndef  USBD_CFG_STR_EN
#error  "USBD_CFG_STR_EN not #define'd in 'usbd_cfg.h' [MUST be 0u || 1u]"

#elif  ((USBD_CFG_STR_EN != 0u) \
  && (USBD_CFG_STR_EN != 1u))
#error  "USBD_CFG_STR_EN illegally #define'd in 'usbd_cfg.h' [MUST be 0u || 1u]"
#endif

#ifndef  USBD_CFG_URB_EXTRA_EN
#error  "USBD_CFG_URB_EXTRA_EN not #define'd in 'usbd_cfg.h' [MUST be 0u || 1u]"

#elif  ((USBD_CFG_URB_EXTRA_EN != 0u) \
  && (USBD_CFG_URB_EXTRA_EN != 1u))
#error  "USBD_CFG_URB_EXTRA_EN illegally #define'd in 'usbd_cfg.h' [MUST be 0u || 1u]"
#endif

#ifndef  USBD_CFG_MS_OS_DESC_EN
#error  "USBD_CFG_MS_OS_DESC_EN not #define'd in 'usbd_cfg.h' [MUST be 0u || 1u]"

#elif  ((USBD_CFG_MS_OS_DESC_EN != 0u) \
  && (USBD_CFG_MS_OS_DESC_EN != 1u))
#error  "USBD_CFG_MS_OS_DESC_EN illegally #define'd in 'usbd_cfg.h' [MUST be 0u || 1u]"

#elif  ((USBD_CFG_MS_OS_DESC_EN == 1u) \
  && (USBD_CFG_STR_EN == 0u))
#error  "USBD_CFG_STR_EN illegally #define'd in 'usbd_cfg.h'. MUST be 1u when USBD_CFG_MS_OS_DESC_EN is 1u"
#endif

/****************************************************************************************************//**
 ********************************************************************************************************
 * @}                                          MODULE END
 ********************************************************************************************************
 *******************************************************************************************************/

#endif
